# running in proofs_lsu_taskBMC30_ni_lsu/src/
read -formal -DEXPOSE_STATE cva6_lsu_formal.v
read -formal -DEXPOSE_STATE load_store_unit.v
read -formal shift_reg.v
read -formal -DEXPOSE_STATE store_unit.v
read -formal -DEXPOSE_STATE store_buffer.v
read -formal amo_buffer.v
read -formal -DEXPOSE_STATE load_unit.v
read -formal lsu_bypass.v
read -formal -DEXPOSE_STATE -DUSE_SHIM cva6_processor_shim.v
read -formal -DEXPOSE_STATE cva6_lsu_shim.v
prep -top cva6_lsu_formal


memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
