# running in proofs_lsu_taskBMC30_ni_model_lsu/src/

read -formal -DEXPOSE_STATE cva6_lsu_formal.v
read -formal -DEXPOSE_STATE -DUSE_MODEL cva6_processor_shim.v
read -formal -DEXPOSE_STATE cva6_lsu_model.v
prep -top cva6_lsu_formal

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
