# running in sec_taskBMC20_sodor5_model_lb_u/src/

read -formal -DLB_VERIF -DRANDOMIZE -DDATAOPT sodor5_model_ilstype_full.v
read -formal -DMODEL sodor5_lb_unified_bmc.v
read_verilog -formal -DSODOR5_SIGNALS SimpleDMem.v
prep -top sodor5_verif

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
